Revit 2027 API
ExternalResourceLoadData.GetLoadContent Method
 Returns the ExternalResourceLoadContent resulting from this load operation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalResourceLoadContent GetLoadContent()
Public Function GetLoadContent As ExternalResourceLoadContent
public:
ExternalResourceLoadContent^ GetLoadContent()
member GetLoadContent : unit -> ExternalResourceLoadContent
Return Value
ExternalResourceLoadContent
 A reference to an ExternalResourceLoadContent object.
Remarks
 This object contains the content produced by the call to the IExternalResourceServer's LoadResource method.
See Also
Reference
ExternalResourceLoadData Class
Autodesk.Revit.DB Namespace